Revit 2027 API
ExternallyTaggedGeometryValidation.IsNonSolid Method
 Makes sure that the input geometry object is not a Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsNonSolid(
	GeometryObject geometry
)
Public Shared Function IsNonSolid (
	geometry As GeometryObject
) As Boolean
public:
static bool IsNonSolid(
	GeometryObject^ geometry
)
static member IsNonSolid :
        geometry : GeometryObject -> bool
Parameters
geometry GeometryObject
 Geometry object to be validated.
Return Value
Boolean
 True if the supplied geometry object is not a Solid.
Remarks
 This validation is different than negating IsSolid().
See Also
Reference
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace